Java/introjavafx.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Getting started with JavaFX</title>
<!-- 2016-02-02 Tue 21:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">Getting started with JavaFX</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">The View Model</a></li>
<li><a href="#sec-3">The View</a></li>
<li><a href="#sec-4">Main</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is set of notes for a quick start for JavaFX, using an MVVM
pattern to create the simplest of apps.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">The View Model</h2>
<div class="outline-text-2" id="text-2">
<p>
The view model holds the code for UI behaviour, so that all the view
needs to be is presentation layout and bindings. The view model is
as follows:
</p>

<div class="org-src-container">

<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #859900;">package</span> <span style="color: #2aa198;">sample</span>;
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #859900;">import</span> <span style="color: #2aa198;">javafx</span>.<span style="color: #2aa198;">beans</span>.<span style="color: #2aa198;">property</span>.<span style="color: #b58900;">ReadOnlyStringProperty</span>;
<span class="linenr"> 4: </span><span style="color: #859900;">import</span> <span style="color: #2aa198;">javafx</span>.<span style="color: #2aa198;">beans</span>.<span style="color: #2aa198;">property</span>.<span style="color: #b58900;">SimpleStringProperty</span>;
<span class="linenr"> 5: </span><span style="color: #859900;">import</span> <span style="color: #2aa198;">javafx</span>.<span style="color: #2aa198;">beans</span>.<span style="color: #2aa198;">property</span>.<span style="color: #b58900;">StringProperty</span>;
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #859900;">public</span> <span style="color: #859900;">class</span> <span style="color: #b58900;">SampleViewModel</span> {
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>        <span style="color: #859900;">private</span> <span style="color: #859900;">final</span> <span style="color: #b58900;">StringProperty</span> <span style="color: #268bd2;">textValue</span> = <span style="color: #859900;">new</span> <span style="color: #b58900;">SimpleStringProperty</span>();
<span class="linenr">10: </span>
<span class="linenr">11: </span>        <span style="color: #859900;">public</span> <span style="color: #b58900;">StringProperty</span> <span style="color: #268bd2;">textValueProperty</span>() {
<span class="linenr">12: </span>                <span style="color: #859900;">return</span> textValue;
<span class="linenr">13: </span>        }
<span class="linenr">14: </span>
<span class="linenr">15: </span>        <span style="color: #859900;">public</span> <span style="color: #b58900;">ReadOnlyStringProperty</span> <span style="color: #268bd2;">echoTextValueProperty</span>(){
<span class="linenr">16: </span>                <span style="color: #859900;">return</span> textValue;
<span class="linenr">17: </span>        }
<span class="linenr">18: </span>
<span class="linenr">19: </span>        <span style="color: #859900;">public</span> <span style="color: #b58900;">void</span> <span style="color: #268bd2;">clearText</span>() {
<span class="linenr">20: </span>                textValue.setValue(<span style="color: #2aa198;">""</span>);
<span class="linenr">21: </span>        }
<span class="linenr">22: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">The View</h2>
<div class="outline-text-2" id="text-3">
<p>
The view then has to be defined in 2 files.
</p>

<p>
The first file is the Controller class that defines the fields and
the bindings to the View Model. Ideally the View Model would be
injected in a constructor or via some other property.
</p>

<div class="org-src-container">

<pre class="src src-java"><span class="linenr">23: </span><span style="color: #859900;">package</span> <span style="color: #2aa198;">sample</span>;
<span class="linenr">24: </span>
<span class="linenr">25: </span><span style="color: #859900;">import</span> <span style="color: #2aa198;">javafx</span>.<span style="color: #2aa198;">event</span>.<span style="color: #b58900;">ActionEvent</span>;
<span class="linenr">26: </span><span style="color: #859900;">import</span> <span style="color: #2aa198;">javafx</span>.<span style="color: #2aa198;">fxml</span>.<span style="color: #b58900;">FXML</span>;
<span class="linenr">27: </span><span style="color: #859900;">import</span> <span style="color: #2aa198;">javafx</span>.<span style="color: #2aa198;">scene</span>.<span style="color: #2aa198;">control</span>.<span style="color: #b58900;">Label</span>;
<span class="linenr">28: </span><span style="color: #859900;">import</span> <span style="color: #2aa198;">javafx</span>.<span style="color: #2aa198;">scene</span>.<span style="color: #2aa198;">control</span>.<span style="color: #b58900;">TextField</span>;
<span class="linenr">29: </span>
<span class="linenr">30: </span>
<span class="linenr">31: </span><span style="color: #859900;">public</span> <span style="color: #859900;">class</span> <span style="color: #b58900;">SampleView</span> {
<span class="linenr">32: </span>
<span class="linenr">33: </span>        <span style="color: #b58900;">SampleViewModel</span> <span style="color: #268bd2;">vm</span> = <span style="color: #859900;">new</span> <span style="color: #b58900;">SampleViewModel</span>();
<span class="linenr">34: </span>
<span class="linenr">35: </span>        <span style="color: #2aa198;">@FXML</span>
<span class="linenr">36: </span>        <span style="color: #859900;">private</span> <span style="color: #b58900;">TextField</span> <span style="color: #268bd2;">textField</span>;
<span class="linenr">37: </span>
<span class="linenr">38: </span>        <span style="color: #2aa198;">@FXML</span>
<span class="linenr">39: </span>        <span style="color: #859900;">private</span> <span style="color: #b58900;">Label</span> <span style="color: #268bd2;">echoTextField</span>;
<span class="linenr">40: </span>
<span class="linenr">41: </span>        <span style="color: #2aa198;">@FXML</span>
<span class="linenr">42: </span>        <span style="color: #b58900;">void</span> <span style="color: #268bd2;">initialize</span>() {
<span class="linenr">43: </span>
<span class="linenr">44: </span>                textField.textProperty().bindBidirectional(vm.textValueProperty());
<span class="linenr">45: </span>                echoTextField.textProperty().bind(vm.echoTextValueProperty());
<span class="linenr">46: </span>        }
<span class="linenr">47: </span>
<span class="linenr">48: </span>        <span style="color: #859900;">public</span> <span style="color: #b58900;">void</span> <span style="color: #268bd2;">clearText</span>(<span style="color: #b58900;">ActionEvent</span> <span style="color: #268bd2;">actionEvent</span>) {
<span class="linenr">49: </span>                vm.clearText();
<span class="linenr">50: </span>        }
<span class="linenr">51: </span>}
</pre>
</div>

<p>
The layout of the view is then defined in a FXML file:
</p>

<div class="org-src-container">

<pre class="src src-xml"><span class="linenr">52: </span>&lt;?<span style="color: #859900;">xml</span> <span style="color: #268bd2;">version</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">1.0</span><span style="color: #2aa198;">"</span> <span style="color: #268bd2;">encoding</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">UTF-8</span><span style="color: #2aa198;">"</span>?&gt;
<span class="linenr">53: </span>
<span class="linenr">54: </span>&lt;?<span style="color: #859900;">import</span> <span style="color: #586e75; font-style: italic;">javafx.scene.control.TextField</span>?&gt;
<span class="linenr">55: </span>&lt;?<span style="color: #859900;">import</span> <span style="color: #586e75; font-style: italic;">javafx.scene.layout.*</span>?&gt;
<span class="linenr">56: </span>
<span class="linenr">57: </span>&lt;?<span style="color: #859900;">import</span> <span style="color: #586e75; font-style: italic;">javafx.scene.control.Button</span>?&gt;
<span class="linenr">58: </span>&lt;?<span style="color: #859900;">import</span> <span style="color: #586e75; font-style: italic;">javafx.scene.control.Label</span>?&gt;
<span class="linenr">59: </span>&lt;<span style="color: #268bd2;">GridPane</span> <span style="color: #859900;">xmlns</span>:<span style="color: #268bd2;">fx</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">http://javafx.com/fxml/1</span><span style="color: #2aa198;">"</span> <span style="color: #859900;">xmlns</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">http://javafx.com/javafx/8</span><span style="color: #2aa198;">"</span>
<span class="linenr">60: </span>          <span style="color: #268bd2;">alignment</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">center</span><span style="color: #2aa198;">"</span> <span style="color: #268bd2;">hgap</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">10</span><span style="color: #2aa198;">"</span> <span style="color: #268bd2;">vgap</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">10</span><span style="color: #2aa198;">"</span> <span style="color: #859900;">fx</span>:<span style="color: #268bd2;">controller</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">sample.SampleView</span><span style="color: #2aa198;">"</span>&gt;
<span class="linenr">61: </span>   &lt;<span style="color: #268bd2;">children</span>&gt;
<span class="linenr">62: </span>      &lt;<span style="color: #268bd2;">TextField</span> <span style="color: #268bd2;">GridPane.rowIndex</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">0</span><span style="color: #2aa198;">"</span> <span style="color: #859900;">fx</span>:<span style="color: #268bd2;">id</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">textField</span><span style="color: #2aa198;">"</span> /&gt;
<span class="linenr">63: </span>      &lt;<span style="color: #268bd2;">Label</span> <span style="color: #268bd2;">GridPane.rowIndex</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">1</span><span style="color: #2aa198;">"</span> <span style="color: #859900;">fx</span>:<span style="color: #268bd2;">id</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">echoTextField</span><span style="color: #2aa198;">"</span>/&gt;
<span class="linenr">64: </span>      &lt;<span style="color: #268bd2;">Button</span> <span style="color: #268bd2;">GridPane.rowIndex</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">2</span><span style="color: #2aa198;">"</span> <span style="color: #859900;">fx</span>:<span style="color: #268bd2;">id</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">clearButton</span><span style="color: #2aa198;">"</span> <span style="color: #268bd2;">onAction</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">#clearText</span><span style="color: #2aa198;">"</span>&gt;Clear&lt;/<span style="color: #268bd2;">Button</span>&gt;
<span class="linenr">65: </span>   &lt;/<span style="color: #268bd2;">children</span>&gt;
<span class="linenr">66: </span>   &lt;<span style="color: #268bd2;">columnConstraints</span>&gt;
<span class="linenr">67: </span>      &lt;<span style="color: #268bd2;">ColumnConstraints</span> /&gt;
<span class="linenr">68: </span>   &lt;/<span style="color: #268bd2;">columnConstraints</span>&gt;
<span class="linenr">69: </span>   &lt;<span style="color: #268bd2;">rowConstraints</span>&gt;
<span class="linenr">70: </span>      &lt;<span style="color: #268bd2;">RowConstraints</span> /&gt;
<span class="linenr">71: </span>      &lt;<span style="color: #268bd2;">RowConstraints</span> /&gt;
<span class="linenr">72: </span>   &lt;/<span style="color: #268bd2;">rowConstraints</span>&gt;
<span class="linenr">73: </span>&lt;/<span style="color: #268bd2;">GridPane</span>&gt;
</pre>
</div>

<p>
This references the code behind class and properties. Ideally it
would be good if these two files could be merged a bit more and the
bindings could be set in the FXML itself.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Main</h2>
<div class="outline-text-2" id="text-4">
<p>
The main function is then defined as follows:
</p>

<div class="org-src-container">

<pre class="src src-java"><span class="linenr">74: </span><span style="color: #859900;">package</span> <span style="color: #2aa198;">sample</span>;
<span class="linenr">75: </span>
<span class="linenr">76: </span><span style="color: #859900;">import</span> <span style="color: #2aa198;">javafx</span>.<span style="color: #2aa198;">application</span>.<span style="color: #b58900;">Application</span>;
<span class="linenr">77: </span><span style="color: #859900;">import</span> <span style="color: #2aa198;">javafx</span>.<span style="color: #2aa198;">fxml</span>.<span style="color: #b58900;">FXMLLoader</span>;
<span class="linenr">78: </span><span style="color: #859900;">import</span> <span style="color: #2aa198;">javafx</span>.<span style="color: #2aa198;">scene</span>.<span style="color: #b58900;">Parent</span>;
<span class="linenr">79: </span><span style="color: #859900;">import</span> <span style="color: #2aa198;">javafx</span>.<span style="color: #2aa198;">scene</span>.<span style="color: #b58900;">Scene</span>;
<span class="linenr">80: </span><span style="color: #859900;">import</span> <span style="color: #2aa198;">javafx</span>.<span style="color: #2aa198;">stage</span>.<span style="color: #b58900;">Stage</span>;
<span class="linenr">81: </span>
<span class="linenr">82: </span><span style="color: #859900;">public</span> <span style="color: #859900;">class</span> <span style="color: #b58900;">Main</span> <span style="color: #859900;">extends</span> <span style="color: #b58900;">Application</span> {
<span class="linenr">83: </span>
<span class="linenr">84: </span>        <span style="color: #2aa198;">@Override</span>
<span class="linenr">85: </span>        <span style="color: #859900;">public</span> <span style="color: #b58900;">void</span> <span style="color: #268bd2;">start</span>(<span style="color: #b58900;">Stage</span> <span style="color: #268bd2;">primaryStage</span>) <span style="color: #859900;">throws</span> <span style="color: #b58900;">Exception</span>{
<span class="linenr">86: </span>                <span style="color: #b58900;">Parent</span> <span style="color: #268bd2;">root</span> = FXMLLoader.load(getClass().getResource(<span style="color: #2aa198;">"SampleView.fxml"</span>));
<span class="linenr">87: </span>                primaryStage.setTitle(<span style="color: #2aa198;">"Hello World"</span>);
<span class="linenr">88: </span>                primaryStage.setScene(<span style="color: #859900;">new</span> <span style="color: #b58900;">Scene</span>(root, 300, 275));
<span class="linenr">89: </span>                primaryStage.show();
<span class="linenr">90: </span>        }
<span class="linenr">91: </span>
<span class="linenr">92: </span>
<span class="linenr">93: </span>        <span style="color: #859900;">public</span> <span style="color: #859900;">static</span> <span style="color: #b58900;">void</span> <span style="color: #268bd2;">main</span>(<span style="color: #b58900;">String</span>[] <span style="color: #268bd2;">args</span>) {
<span class="linenr">94: </span>                launch(args);
<span class="linenr">95: </span>        }
<span class="linenr">96: </span>}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2016-02-02 Tue 21:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
